E4 updates 7
